{
  "date": "2026-02-18",
  "entry_count": 1,
  "entries": [
    {
      "title": "IKEA announces plans to open small-format store in Chicago suburb",
      "link": "https://chicago.suntimes.com/money/2026/02/17/ikea-gurnee-furniture-small-format-store-chicago-suburb",
      "published": "2026-02-17T18:10:23.072-06:00",
      "published_parsed": "2026-02-18T00:10:23",
      "summary": "<img alt=\"Customers wait in line before the grand opening of IKEA's Bolingbrook store in 2005.\" src=\"https://cst.brightspotcdn.com/dims4/default/913e4fc/2147483647/strip/true/crop/3076x1800+0+0/resize/840x492!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F97%2Ff5%2F7d47a2fe489e852f2cc03b18a017%2Fikea039.JPG\" />\n        \n        \n            &lt;p&gt;Swedish retail giant IKEA is gearing up to open its third store in Illinois, but the space will be a new format, the company announced on Tuesday. &lt;/p&gt;&lt;p&gt;The new store at Gurnee Mills Shopping Mall, 6136 W. Grand Ave., will bring \"the IKEA experience closer to where people live, work, socialize and shop — just in a smaller footprint,\" a company spokesperson said, who added that the store is expected to open in the fall. &lt;/p&gt;&lt;p&gt;It’s part of the company’s larger goal of opening 10 stores during the 2026 fiscal year, including in Tulsa, Oklahoma, Fort Collins, Colorado, and Los Angeles.&lt;/p&gt;&lt;p&gt;Known for its massive stores, the smaller-format site in Gurnee will be about 66,000 square feet, according to a news release. &lt;/p&gt;&lt;p&gt;Customers will have the chance to shop from a curated selection of 3,000 items, including home furnishings, accessories and small furniture items.&amp;nbsp;There will also be a centralized \"planning area,\" where customers can meet with IKEA's design consultants. And like it's larger warehouse locations, it'll serve its famous Swedish meatballs, as well as hot dogs and cinnamon buns.&lt;/p&gt;&lt;p&gt;The Gurnee store joins IKEA's other locations in Bolingbrook and Schaumburg. IKEA's nearly 310,000-square-foot Bolingbrook store opened in 2005. Schaumburg's location, at over 400,000 square feet, opened in 1998, and at the time, was the company's largest store in North America. &lt;/p&gt;&lt;p&gt;In 2025, IKEA opened 14 retail locations. &lt;/p&gt;&lt;p&gt;“[2025] was a year of meaningful connection and growth despite a challenging external environment,” Rob Olson, interim CEO of IKEA U.S., said in a news release. “Looking ahead to [fiscal year 2026], we will build on this momentum, focusing on continued investment in the U.S. to make IKEA more affordable, accessible and sustainable.”&lt;/p&gt;",
      "author": "Mariah Rush",
      "id": "https://chicago.suntimes.com/money/2026/02/17/ikea-gurnee-furniture-small-format-store-chicago-suburb",
      "tags": []
    }
  ],
  "last_updated": "2026-02-18T00:18:20.921049"
}