{
  "date": "2026-02-22",
  "entry_count": 1,
  "entries": [
    {
      "title": "How Tokyo Series prepared Cubs' Matthew Boyd for WBC ramp-up",
      "link": "https://chicago.suntimes.com/cubs/2026/02/21/how-tokyo-series-prepared-cubs-matthew-boyd-for-wbc-ramp-up",
      "published": "2026-02-21T18:01:14.108-06:00",
      "published_parsed": "2026-02-22T00:01:14",
      "summary": "<img alt=\"Matthew Boyd throws a pitch during a spring training start at Sloan Park in Mesa, AZ on February 21, 2026.\" src=\"https://cst.brightspotcdn.com/dims4/default/65c97ef/2147483647/strip/true/crop/4200x2800+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fd1%2Fac%2F84d9382c402eb4f74796fabe92b8%2Fst26-boyd-03-f21.jpg\" />\n        \n        \n            &lt;p&gt;MESA, Ariz. – When left-hander &lt;b&gt;Matthew Boyd&lt;/b&gt; jogged out to the mound for his first spring training start, he and the &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs\"   &gt;Cubs&lt;/a&gt; already had a good sense of the World Baseball Classic schedule he was building up to.&lt;/p&gt;&lt;p&gt;“I'm not going to be doing something, in terms of between the white lines, that's different than what I've done before,” he said after throwing 1 ⅔ innings Saturday in the Cubs’ 3-2 loss to the Rangers.&lt;/p&gt;&lt;p&gt;Boyd praised Team USA manager &lt;b&gt;Mark DeRosa&lt;/b&gt; and pitching coach &lt;b&gt;Andy Pettitte &lt;/b&gt;for their communication with Cubs manager &lt;b&gt;Craig Counsell &lt;/b&gt;and pitching coach &lt;b&gt;Tommy Hottovy&lt;/b&gt;. The plan, Boyd said, is to use him like a starter – but that also includes piggyback setups like the Cubs used last March in Tokyo.&lt;/p&gt;&lt;p&gt;For the second exhibition game in Japan last spring, Boyd technically entered in relief, but that was scripted. He went through his normal start-day routine, and the Cubs had reliever &lt;b&gt;Daniel Palencia&lt;/b&gt; throw ⅔ of an inning to bridge the gap between right-handed starter &lt;b&gt;Jameson Taillon&lt;/b&gt; and Boyd.&lt;/p&gt;&lt;p&gt;In that game, on March 16, &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs/2025/03/16/cubs-matt-boyd-has-his-best-outing-so-far-this-spring-in-exhibition-game-vs-yomiuri-giants\"   &gt;Boyd showcased a jump in velocity&lt;/a&gt;. Then he went on to have a healthy 2025 season and collect the first All-Star selection of his career.&lt;/p&gt;&lt;p&gt;This year's WBC is in a similar time frame, running from March 6-17.&lt;/p&gt;&lt;p&gt;“Very comparable,\" Boyd said. “That's part of the reason why it was such an easy yes to go do the WBC stuff, is this because it's very similar to what we did.”&lt;/p&gt;&lt;p&gt;On Saturday, Boyd struck out two of the first three batters he faced but allowed three singles in the first inning. He navigated the traffic successfully to keep the Rangers from scoring.&lt;/p&gt;&lt;p&gt;The second inning played out similarly, with two strikeouts, a double and a single. But Boyd allowed a run before handing the ball over with two outs.&lt;/p&gt;&lt;p&gt;“It was good work,” Boyd said, “Pitched with some runners on base, had to work with a guy on second, had to start some guys off with off speed and whatnot.”&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Long exits after collision&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;Cubs first baseman &lt;b&gt;Jonathon Long &lt;/b&gt;left the game in the fourth inning Saturday with a sprained left elbow, according to the team.&lt;/p&gt;&lt;p&gt;As the Rangers’ Mark Canha raced up the line to beat out a ground ball to the left side of the infield, shortstop &lt;b&gt;Jefferson Rojas&lt;/b&gt;’ throw pulled Long into the basepath. Canha ran into Long’s extended glove. Long dropped the ball, and hunched over, cradling his left arm.&lt;/p&gt;&lt;p&gt;After an on-field examination, Long exited the field with head athletic trainer &lt;b&gt;Nick Frangella&lt;/b&gt;.&lt;/p&gt;&lt;p&gt;Long, a non-roster invitee, was scheduled to depart Cubs camp next week to join the Chinese Taipei national team for the WBC. The injury raised questions about his availability for the tournament, but he will be re-evaluated Sunday.&lt;/p&gt;&lt;h3&gt;&lt;b&gt;Ballesteros en route&lt;/b&gt;&lt;/h3&gt;&lt;p&gt;On top of the &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs/2026/02/15/cubs-moises-ballesteros-likely-to-be-delayed-by-visa-issues-for-another-week\"   &gt;visa issues catcher&lt;b&gt; Moisés Ballesteros&lt;/b&gt; had been navigating,&lt;/a&gt; he also went through flight delays, manager &lt;b&gt;Craig Counsell &lt;/b&gt;said Saturday. Ballesteros was not in camp Saturday morning, but he had reached Houston, Texas – a promising sign in a saga that’s already delayed his arrival a week and half past his report date.&lt;/p&gt;&lt;p&gt;He’s not expected to appear in spring training this week, as he ramps up, but Counsell isn’t expecting the delay to impact Ballesteros’ readiness for the season.&lt;br&gt;&lt;/p&gt;",
      "author": "Maddie Lee",
      "id": "https://chicago.suntimes.com/cubs/2026/02/21/how-tokyo-series-prepared-cubs-matthew-boyd-for-wbc-ramp-up",
      "tags": []
    }
  ],
  "last_updated": "2026-02-22T00:17:05.948651"
}