{
  "date": "2026-02-21",
  "entry_count": 1,
  "entries": [
    {
      "title": "Munetaka Murakami, fashionably late, impresses in Cactus League debut",
      "link": "https://chicago.suntimes.com/white-sox/2026/02/20/munetaka-murakami-fashionably-late-impresses-in-cactus-league-debut",
      "published": "2026-02-20T18:02:20.191-06:00",
      "published_parsed": "2026-02-21T00:02:20",
      "summary": "<img alt=\"Chicago White Sox's Munetaka Murakami, of Japan, watches the flight of his two-run double against the Chicago Cubs during the fourth inning of a spring training baseball game Friday, Feb. 20, 2026, in Mesa, Ariz.\" src=\"https://cst.brightspotcdn.com/dims4/default/7f1850f/2147483647/strip/true/crop/1024x683+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F3b%2F44%2F9da6cee7411cae1318e4867f8787%2Fmurakami.jpg\" />\n        \n        \n            &lt;p&gt;MESA, Ariz. — Munetaka Murakami is rarely seen in the White Sox clubhouse for an extended period of time.&lt;/p&gt;&lt;p&gt;From one workout to another, he’s always on the move — except for on his ride to Sloan Park for Friday’s Cactus League opener against the Cubs.&lt;/p&gt;&lt;p&gt;Murakami and numerous other Sox were stuck in traffic due to a crash on the interstate, nearly scratching the Japanese slugger from his first Spring Training start. He made it just in time, minutes before first pitch, and batted cleanup and started at first base.&lt;/p&gt;&lt;p&gt;“Oh my god!” Murakami said in English after the game when asked about running late, punching his fist animating a crash.&lt;/p&gt;&lt;p&gt;“I’m really happy how it went without any injuries,” Murakami said through translator Kenzo Yagi. He was still in the car at 12:50 p.m. for the 1:05 p.m. start, he noted.&lt;/p&gt;&lt;p&gt;“I had butterflies inside me the first few minutes of it. But after I started fielding and I got an at-bat, I felt a bit more comfortable and felt myself,” Murakami said.&lt;/p&gt;&lt;p&gt;All snafus aside, Murakami came inches away from a grand slam when his countryman Seiya Suzuki lost a fly ball in the sun and let it drop on the warning track. It turned into a two-run double.&lt;/p&gt;&lt;p&gt;“It was a great at-bat. I was able to get good angles on the bat and velocity. I’m really happy how it went and how it went over my friend as well,” Murakami said.&lt;/p&gt;&lt;p&gt;Sox manager Will Venable commended Murakami’s ability to “collect himself” quickly and still be able to put together a 2-for-4 day with a two-run double, single and a strikeout in the Sox’ 8-1 win.&lt;/p&gt;&lt;p&gt;Asked about his first impression of Murakami so far in spring camp, new Sox hitting coach Derek Shomon used one word: “worker.”&lt;/p&gt;&lt;p&gt;“[He] does not shy away from the work,” Shomon said. “Been very clear about wanting the information. [He] wants to utilize the resources that we have. I think more times than not it might be trying to pull him out of the cage and remind him to breathe, than to having to push him in the cage to actually get work done. The guy works really hard. It’s been fun to see.”&lt;/p&gt;&lt;p&gt;At first base, Murakami knocked down a hard-hit groundball (112 mph exit velocity), corralled it and tossed to pitcher Jonathan Cannon for his first assist.&lt;/p&gt;&lt;p&gt;“I’m trying really hard to get adjusted to the field work,” Murakami, 26, said, adding that third baseman Miguel Vargas has provided some defensive tips so far in camp.&lt;/p&gt;&lt;p&gt;Sox manager Will Venable said he’ll give the corner infielder some playing time at third base, especially ahead of the World Baseball Classic next month since he’ll likely see a bulk of time there for Team Japan.&lt;/p&gt;&lt;p&gt;Murakami said he plans to play in five Cactus League games before departing for the WBC.&lt;/p&gt;&lt;p&gt;The Sox signed the 6-foot-2, 213 lb. right-hander to a two-year $12 million deal in December, making him one of the most distinguished international free-agent signings in franchise history.&lt;/p&gt;&lt;p&gt;In Japan, Murakami won back-to-back MVPs in 2021 and 2022. The latter year, at age 22, he set the Nippon Professional Baseball league record as the youngest triple crown winner and set the single-season home run record with 56 homers.&lt;/p&gt;&lt;p&gt;Murakami has been knocked for his high whiff rate, which he is well aware of.&lt;/p&gt;&lt;p&gt;“This guy’s smart, he really is. The aptitude is there. He has an understanding of likely what is going to be exposed and he’s doing a really good job attacking it on a daily basis and being really intentional with his work,” Shomon said.&lt;/p&gt;",
      "author": "Kade Heather",
      "id": "https://chicago.suntimes.com/white-sox/2026/02/20/munetaka-murakami-fashionably-late-impresses-in-cactus-league-debut",
      "tags": []
    }
  ],
  "last_updated": "2026-02-21T00:17:16.611183"
}