{
  "date": "2026-02-20",
  "entry_count": 6,
  "entries": [
    {
      "title": "Democratic Senate frontrunners stick to talking points, split on Israeli-Palestinian conflict",
      "link": "https://chicago.suntimes.com/politics/2026/02/19/democratic-senate-frontrunners-stick-to-talking-points-split-on-israeli-palestinian-conflict",
      "published": "2026-02-19T21:33:37.441-06:00",
      "published_parsed": "2026-02-20T03:33:37",
      "summary": "<img alt=\"U.S. Rep. Robin Kelly, D-Ill., left, U.S. Rep. Raja Krishnamoorthi, D-Ill., center, and Illinois Lt. Gov. Juliana Stratton (D), candidates for the U.S. Senate, attend Thursday a U.S. Senate Democratic Primary Debate, in Chicago.\" src=\"https://cst.brightspotcdn.com/dims4/default/3913e84/2147483647/strip/true/crop/4950x3300+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F88%2F18%2F08a425a74a9b89099403c3ba04af%2Fus-election-2026-illinois-senate.jpg\" />\n        \n        \n            &lt;p&gt;The three front runners for U.S. Sen. Dick Durbin’s seat mostly kept to their prior scripts at a debate broadcast by WGN Thursday night, splitting the most on the Israeli-Palestinian conflict. &lt;/p&gt;&lt;p&gt;The debate, hosted by Nexstar and moderated by WGN political editor Tahman Bradley and anchor Micah Materre, saw Lt. Gov. Juliana Stratton and U.S. Reps. Robin Kelly and Raja Krishnamoorthi as the only candidates &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/02/06/what-to-know-us-senate-primary-midterms-dick-durbin-seat\"  target=\"_blank\"   &gt;&lt;u&gt;in a field of 10&lt;/u&gt;&lt;/a&gt; who met the &lt;a class=\"Link\"  href=\"https://wgntv.com/wp-content/uploads/sites/5/2026/02/Nexstar-Debate-Criteria-2026-1.pdf\"  target=\"_blank\"   &gt;&lt;u&gt;network’s requirements to&lt;/u&gt;&lt;/a&gt; appear.&lt;/p&gt;&lt;p&gt;The debate opened with Stratton and Krishnamoorthi once again trading barbs over campaign funds. &lt;/p&gt;&lt;p&gt;Stratton took shots at Krishnamoorthi for &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/the-watchdogs/2025/12/08/raja-krishnamoorthi-senate-campaign-donors-trump-allies-maga-money\"  target=\"_blank\"   &gt;&lt;u&gt;taking campaign contributions&lt;/u&gt;&lt;/a&gt; from supporters of President Donald Trump, as well as an executive at a company contracted by ICE — a month after Stratton went on the offensive during an &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/01/26/senate-debate-sun-times-wbez-uchicago-krishnamoorthi-stratton-kelly\"  target=\"_blank\"   &gt;&lt;u&gt;hourlong debate&lt;/u&gt;&lt;/a&gt; hosted by the Chicago Sun-Times, WBEZ and UChicago’s Institute of Politics and International House&lt;/p&gt;&lt;p&gt;Krishnamoorthi shot back at Stratton for allowing the Democratic Lieutenant Governor’s Association to take money from CoreCivic, a private prison and ICE contractor, in 2024. He added that he had since donated the money he received to three immigrant groups, which he did not name.&lt;/p&gt;&lt;p&gt;“Those are his values, he’s not going to be one to stand up to the people,” Stratton said.&lt;/p&gt;&lt;p&gt;Krishnamoorthi shot back: \"I’m an immigrant, I don't need a lecture on standing up to ICE.\"&lt;/p&gt;&lt;p&gt;Krishnamoorthi once again called to specifically abolish “Trump’s ICE\" as opposed to Stratton's wider call to abolish ICE. Kelly said U.S. Secretary of Homeland Security Kristi Noem must be removed and federal agents “have to have rules like regular police officers do.”&lt;/p&gt;&lt;div class=\"RelatedList Enhancement\" data-module data-align-center&gt;\n    \n     &lt;div class=\"RelatedList-title\"&gt;Related&lt;/div&gt;\n    \n\n    \n        &lt;ul class=\"RelatedList-items\"&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/01/26/senate-debate-illinois-krishnamoorthi-stratton-kelly\"   &gt;Lt. Gov. Stratton goes on attack in Sun-Times, WBEZ, UChicago debate against U.S. Reps. Kelly, Krishnamoorthi&lt;/a&gt;\n                &lt;/li&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/01/29/us-senate-democratic-primary-abc7-debate-krishnamoorthi-kelly-stratton\"   &gt;TV ads heat up in U.S. Senate race, as Dems try to highlight their differences in second debate&lt;/a&gt;\n                &lt;/li&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/02/12/underdog-u-s-senate-candidates-call-for-new-voices-in-washington-at-uchicago-debate\"   &gt;Underdog U.S. Senate candidates call for new voices in Washington at U. of C. debate&lt;/a&gt;\n                &lt;/li&gt;\n            \n        &lt;/ul&gt;\n    \n&lt;/div&gt;\n&lt;p&gt;The candidates seemed to break the most new ground and widen the gap between them in discussing the Israel-Hamas war in Gaza, which sparked mass protests in the Chicago area as people called for an end to Israeli raids that killed nearly 70,000 Palestinians and razed large parts of Gaza. The war started Oct. 7, 2023, when Hamas led an attack that took 251 hostages and killed nearly 1,200 Israelis. &lt;/p&gt;&lt;p&gt;Stratton said she wanted to “see the suffering end” and wants Israeli Prime Minister Benjamin Netanyahu to step down, but added that she believes Israel has a right to “safety and security.” When the moderators asked her a second time if what Israel is doing is genocide, she stumbled.&lt;/p&gt;&lt;p&gt;Krishnamoorthi said he wanted to see existing restrictions on foreign military funding enacted across the board as a means of reaching a two-state solution.&lt;/p&gt;&lt;p&gt;Kelly noted she is a co-sponsor of the Block the Bombs Act, which would block the president from selling or exporting offensive weapons systems to Israel, and also called for Netanyahu to step down. She was the only candidate who would call Israel's actions genocide.&lt;/p&gt;&lt;p&gt;“There were a lot of things that happened before Oct. 7, also,” Kelly said. “It may not have started that way, but genocide was the result.”&lt;/p&gt;&lt;p&gt;The candidates' remarks were posted online after the debate and can be found at &lt;a class=\"Link\"  href=\"https://wgntv.com/news/politics/wgn-democratic-senate-primary-debate-kelly-krishnamoorthi-stratton-02192026/\"  target=\"_blank\"   &gt;WGNTV.com&lt;/a&gt;. &lt;/p&gt;&lt;p&gt;Also running for the Democratic nomination are Steve Botsford Jr., Sean Brown, Awisi A. Bustos, Jonathan Dean, Bryan Maxwell, Kevin Ryan and Christopher Swann. Some of the &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/02/12/underdog-u-s-senate-candidates-call-for-new-voices-in-washington-at-uchicago-debate\"  target=\"_blank\"   &gt;&lt;u&gt;lesser known candidates&lt;/u&gt;&lt;/a&gt; made their voices heard earlier this month.&lt;/p&gt;&lt;p&gt;Early voting &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/02/12/voters-cast-ballots-at-loop-supersite-as-early-voting-kicks-off-everythings-at-stake\"  target=\"_blank\"   &gt;&lt;u&gt;has already kicked off&lt;/u&gt;&lt;/a&gt; in the race which concludes March 17. The Chicago Board of Elections has received 10,163 ballots, which appears to so far be a higher turn out than the number of ballots that had been received in the first 26 days of early voting during the 2022 and 2018 primaries. &lt;/p&gt;&lt;p&gt;The Democratic primary winner will advance to the Nov. 3 general election against the winner of the Republican field: R. Cary Capparelli, Casey Chlebek, Jeannie Evans, Pamela Denise Long, Jimmy Lee Tillman II or Don Tracy.&lt;/p&gt;&lt;div class=\"RelatedList Enhancement\" data-module data-align-center&gt;\n    \n     &lt;div class=\"RelatedList-title\"&gt;Related&lt;/div&gt;\n    \n\n    \n        &lt;ul class=\"RelatedList-items\"&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/02/06/what-to-know-us-senate-primary-midterms-dick-durbin-seat\"   &gt;What to know about the open U.S. Senate seat to replace Dick Durbin&lt;/a&gt;\n                &lt;/li&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/how-to-vote-illinois-primary\"   &gt;How to cast your ballot in the March 2026 Illinois primary&lt;/a&gt;\n                &lt;/li&gt;\n            \n                &lt;li class=\"RelatedList-items-item\"&gt;\n                    &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/elections/2026/02/04/usps-postmark-change-could-threaten-mail-in-voters-cook-county-officials-warn\"   &gt;USPS postmark change could ‘threaten’ mail-in voters, Cook County officials warn&lt;/a&gt;\n                &lt;/li&gt;\n            \n        &lt;/ul&gt;\n    \n&lt;/div&gt;\n&lt;p&gt;&lt;/p&gt;",
      "author": "Violet Miller",
      "id": "https://chicago.suntimes.com/politics/2026/02/19/democratic-senate-frontrunners-stick-to-talking-points-split-on-israeli-palestinian-conflict",
      "tags": []
    },
    {
      "title": "Bulls will be 'work in progress' as they add Josh Giddey, Tre Jones back to the fold",
      "link": "https://chicago.suntimes.com/bulls/2026/02/19/bulls-will-be-work-in-progress-as-they-add-josh-giddey-tre-jones-back-to-the-fold",
      "published": "2026-02-19T21:15:45.768-06:00",
      "published_parsed": "2026-02-20T03:15:45",
      "summary": "<img alt=\"Bulls forward Julian Phillips (15) and guard Josh Giddey, right, watch from the bench during the second half of an NBA basketball game against the Miami Heat, Saturday, Jan. 31, 2026, in Miami. \" src=\"https://cst.brightspotcdn.com/dims4/default/355141a/2147483647/strip/true/crop/7078x4719+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F48%2F65%2F6917a2a7493298a67c869d69c744%2Fbulls-heat-basketball.jpg\" />\n        \n        \n            &lt;p&gt;The last time Bulls guards &lt;b&gt;Josh Giddey&lt;/b&gt; (hamstring) and &lt;b&gt;Tre Jones&lt;/b&gt; played, &lt;b&gt;Coby White&lt;/b&gt; was in the backcourt and &lt;b&gt;Nikola Vucevic&lt;/b&gt; manned the center position.&lt;/p&gt;&lt;p&gt;With an active trade deadline that saw the Bulls acquire &lt;b&gt;Rob Dillingham&lt;/b&gt;, &lt;b&gt;Collin Sexton&lt;/b&gt;, &lt;b&gt;Jaden Ivey&lt;/b&gt; and &lt;b&gt;Anfernee Simons&lt;/b&gt;, the team is in the process of reintegrating Jones and Giddey with their new players.&lt;/p&gt;&lt;p&gt;“It’s a work in progress,” said acting head coach &lt;b&gt;Wes Unseld Jr.&lt;/b&gt;, who coached Thursday’s game in place of &lt;b&gt;Billy Donovan&lt;/b&gt;. “There’s a comfort level with [Giddey and Jones] having been with us, and then getting them back with the new guys, finding that synergy. They’re starting to feel each other out.”&lt;/p&gt;&lt;p&gt;Unseld said that Giddey and Jones have started making comments on who they would like to be paired with, and that the two would be on a minutes restriction. These remaining 26 games are important in seeing who the Bulls want to keep around in the next phase of executive vice president of basketball operations &lt;b&gt;Artutras Karnisovas’&lt;/b&gt; plan.&lt;/p&gt;&lt;p&gt;&lt;b&gt;Size disadvantage&lt;/b&gt;&lt;/p&gt;&lt;p&gt;The Bulls were already at a size disadvantage before the trade deadline, and they’re certainly facing an uphill battle after acquiring an abundance of guards.&lt;/p&gt;&lt;p&gt;The Bulls aren’t going to get taller or stronger over the last portion of the season, leaving the coaching staff to get creative with their defensive coverages. They can start blitzing pick-and-rolls, picking up full court or having the roll man play more at the level of the screen rather than in a traditional drop coverage.&lt;/p&gt;&lt;p&gt;“We’re going to have to try and do different things, pressure, try to junk the game up at times, keep teams off balance,” Unseld said.&lt;/p&gt;&lt;p&gt;The Bulls entered Thursday ranked 29th in opponents’ turnover percentage (12.3%). They haven’t been a very aggressive defense because of their lack of size and rim protection in the paint. With &lt;b&gt;Nick Richards&lt;/b&gt; and &lt;b&gt;Jalen Smith&lt;/b&gt; as their only nominal centers, the Bulls will have to be more of a pressing defense to compensate.&lt;/p&gt;&lt;p&gt;Second-year forward &lt;b&gt;Matas Buzelis&lt;/b&gt; likely will take on more defensive responsibility. He has proven to be an imposing shot-blocker while serving as a weak-side defender. He has improved his reading of opposing offenses, which has allowed him to react quicker and use his long wingspan to rack up steals, deflections and be a rim deterrent for a team that desperately needs one.&lt;/p&gt;&lt;p&gt;“[Buzelis has] done a better job of keeping those small, quicker, athletic wings and guards in front,” Unseld said. “We keep putting it on him, as far as increasing his workload, his retention to that side of the ball.”&lt;/p&gt;&lt;p&gt;&lt;b&gt;Home cooking&lt;/b&gt;&lt;/p&gt;&lt;p&gt;The Bulls began a seven-game homestand Thursday. The Bulls don’t play their next road game until March 5 in Phoenix. For such a new group trying to find its way together, this time at home could be beneficial.&lt;/p&gt;&lt;p&gt;“Oh, definitely,” Dillingham said. “Because we’re not on the road as much, [then] we all can be closer together. While we’re at home, [we can] get some wins and get some home-field advantage with the fans.”&lt;br&gt;&lt;/p&gt;",
      "author": "Kyle Williams",
      "id": "https://chicago.suntimes.com/bulls/2026/02/19/bulls-will-be-work-in-progress-as-they-add-josh-giddey-tre-jones-back-to-the-fold",
      "tags": []
    },
    {
      "title": "Plan Commission gives green light to Fulton Market tower seeking Downtown-level density",
      "link": "https://chicago.suntimes.com/real-estate/2026/02/19/plan-commission-green-light-fulton-market-downtown-density",
      "published": "2026-02-19T20:03:57.287-06:00",
      "published_parsed": "2026-02-20T02:03:57",
      "summary": "<img alt=\"Rendering of Domus Real Estate Group's apartment tower at 215 N. Racine Ave. in Fulton Market.\" src=\"https://cst.brightspotcdn.com/dims4/default/f443695/2147483647/strip/true/crop/1214x658+0+0/resize/840x455!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fbe%2Fbf%2F145fba794c06be85df2d72b1c705%2F215nracine.png\" />\n        \n        \n            &lt;p&gt;The Chicago Plan Commission gave the first approval Thursday to the developer behind a Fulton Market high-rise that requested a level of zoning historically reserved for Downtown.&lt;/p&gt;&lt;p&gt;Domus Real Estate Group wanted a zoning change from DX-5 to DX-16 — a designation for Downtown mixed-use developments. The number after DX corresponds to the density, with higher numbers allowing for larger buildings.&lt;/p&gt;&lt;p&gt;The Department of Planning and Development’s zoning administrator said the proposed tower at &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/real-estate/2025/07/14/west-town-developer-domus-30-story-residential-tower-fulton-market\"   &gt;215 N. Racine Ave.&lt;/a&gt; was “not appropriate,” making a rare recommendation against the project. The highest level of zoning approved in the project's area is DX-7.&lt;/p&gt;&lt;p&gt;But the Plan Commission voted in favor of the project, which will advance to the Committee on Zoning, Landmarks and Building Standards.&lt;/p&gt;&lt;p&gt;A DPD representative said during the meeting that the agency isn't necessarily opposed to the project. It recommended Domus purchase nearby land to expand the project’s boundaries, or reduce the building’s size and unit count to match the area’s density.&lt;/p&gt;&lt;p&gt;Domus is proposing a 29-story tower with 347 apartments, including 70 affordable units. It would have studios, one-, two- and three-bedroom apartments, the larger of which are a rarity for the area. &lt;/p&gt;&lt;p&gt;There would also be ground floor commercial space, 88 parking spots and an amenity terrace with a pool.&lt;/p&gt;&lt;p&gt;The project includes the purchase of land at 1240 W. Carroll Ave., which would be turned into a privately-managed public park, according to the development team.&lt;/p&gt;&lt;p&gt;One of the biggest requests from Fulton Market residents is green space, along with more family-sized units, Ald. Walter “Red” Burnett (27th) said.&lt;/p&gt;&lt;p&gt;“There’s no green space whatsoever,” Burnett said.&lt;/p&gt;&lt;p&gt;The majority of speakers, many from West Loop or Fulton Market, during the meeting's public comment period spoke in favor of the project. &lt;/p&gt;&lt;p&gt;But the West Central Association Chamber of Commerce wasn’t on board. The chamber’s executive director, Patti Doyle, said they were against the higher zoning designation and the precedent it sets for the neighborhood.&lt;/p&gt;&lt;p&gt;“To be clear, the [chamber] supports more density. We want more family-oriented units and more affordable housing,” Doyle said. “Our position here is about process and precedent and ensuring that growth happens in a way that is consistent, predictable and aligned with long-term planning and growth for the Near West Side.”&lt;/p&gt;&lt;p&gt;DPD Commissioner Ciere Boatright voiced support for Domus' project and said she’s “hyperaware” of the city’s need for more mixed-income housing and development.&lt;/p&gt;&lt;p&gt;She also acknowledged how projects of 215 N. Racine’s scale can create a slippery slope, because those larger projects don’t always get built. Other times, properties get sold after the city rezones them.&lt;/p&gt;&lt;p&gt;Financing for the $175 million project is in place, according to the development team. Boatright said the development agreement includes a clause stipulating the property’s zoning can be reversed if its ownership changes.&lt;/p&gt;&lt;p&gt;“The building alone really fits into what Fulton Market is and where it’s going,” Burnett said. “We need this housing.”&lt;/p&gt;&lt;p&gt;The Plan Commission also approved a 32-story residential tower at 1338 W. Lake St. &lt;/p&gt;&lt;div class=\"Enhancement\" data-align-center&gt;\n        &lt;div class=\"Enhancement-item\" data-crop=\"\"&gt;\n            \n            \n                \n                    \n                        \n                            &lt;figure class=\"Figure\"&gt;&lt;a class=\"AnchorLink\" id=\"image-090000\" name=\"image-090000\"&gt;&lt;/a&gt;\n        &lt;picture data-crop=\"medium\"&gt;\n    \n            \n                \n\n            \n        \n\n        \n        \n            \n    \n            &lt;source type=\"image/webp\"  width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/f14faba/2147483647/strip/true/crop/1004x563+0+212/resize/490x275!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa7%2F5e%2F06c1f9cb446d8bda854064cf6c8d%2Fplancommission-1.jpg 1x,https://cst.brightspotcdn.com/dims4/default/628c485/2147483647/strip/true/crop/1004x563+0+212/resize/980x550!/format/webp/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa7%2F5e%2F06c1f9cb446d8bda854064cf6c8d%2Fplancommission-1.jpg 2x\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n    \n        &lt;source width=\"490\"\n     height=\"275\"\n        data-srcset=\"https://cst.brightspotcdn.com/dims4/default/d6e2dd0/2147483647/strip/true/crop/1004x563+0+212/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa7%2F5e%2F06c1f9cb446d8bda854064cf6c8d%2Fplancommission-1.jpg\" data-lazy-load=\"true\" srcset=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n    /&gt;\n\n    \n\n\n        \n        \n    &lt;img class=\"Image\" alt=\"Rendering of 1338 W. Lake St.\" srcset=\"https://cst.brightspotcdn.com/dims4/default/d6e2dd0/2147483647/strip/true/crop/1004x563+0+212/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa7%2F5e%2F06c1f9cb446d8bda854064cf6c8d%2Fplancommission-1.jpg 1x,https://cst.brightspotcdn.com/dims4/default/6924dc9/2147483647/strip/true/crop/1004x563+0+212/resize/980x550!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa7%2F5e%2F06c1f9cb446d8bda854064cf6c8d%2Fplancommission-1.jpg 2x\" width=\"490\" height=\"275\"\n        data-src=\"https://cst.brightspotcdn.com/dims4/default/d6e2dd0/2147483647/strip/true/crop/1004x563+0+212/resize/490x275!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa7%2F5e%2F06c1f9cb446d8bda854064cf6c8d%2Fplancommission-1.jpg\" data-lazy-load=\"true\" src=\"data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIyNzVweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=\"\n        &gt;\n\n&lt;/picture&gt;\n\n    \n\n    \n        &lt;div class=\"Figure-content\"&gt;&lt;figcaption class=\"Figure-caption\"&gt;&lt;p&gt;Rendering of 1338 W. Lake St.&lt;/p&gt;&lt;/figcaption&gt;&lt;span class=\"line\"&gt;&lt;/span&gt;&lt;div class=\"Figure-credit\"&gt;&lt;p&gt;Courtesy of the Chicago Plan Commission&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n    \n&lt;/figure&gt;\n\n                        \n                    \n                \n            \n        &lt;/div&gt;\n    &lt;/div&gt;&lt;p&gt;Led by Chicago-based CEDARst Cos., the  project would have 321 units, including 65 affordable, ground floor retail, a bike room and rooftop pool. Apartments would range from studios to three-bedroom units.&lt;/p&gt;&lt;p&gt;CEDARst plans to break ground in the fourth quarter.&lt;/p&gt;&lt;p&gt;Commissioners also approved plans for The Phoenix, a 12-story apartment building in Lake View with ground floor retail.&lt;/p&gt;&lt;p&gt;The project was pitched by DLG Management and &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/real-estate/2025/10/30/developer-dlg-pitches-10story-apartment-building-lake-view\"   &gt;drew a heated discussion&lt;/a&gt; during an October 2025 community meeting, hosted by Ald. Angela Clay’s (46th) office. Some neighbors weren’t on board with the building that they said is too dense for the area, while supporters argued that the neighborhood needs more housing.&lt;/p&gt;&lt;p&gt;But on Thursday, speakers overwhelmingly supported the project and pointed to the rapid rise of Chicago rents.&lt;/p&gt;&lt;p&gt;The Plan Commission also gave approval to Sarah’s on Sunnyside, a building for the nonprofit Sarah’s Circle. &lt;/p&gt;&lt;p&gt;Located at 4432-4458 N. Clarendon Ave., the site will serve women facing homelessness, offering 54 supportive housing units for single women, staff office space and community space for residents.&lt;/p&gt;&lt;p&gt;The efficiency units will be 480 square feet and will target homeless women earning 30% of the area median income.&lt;/p&gt;",
      "author": "Abby Miller",
      "id": "https://chicago.suntimes.com/real-estate/2026/02/19/plan-commission-green-light-fulton-market-downtown-density",
      "tags": []
    },
    {
      "title": "Lombard man gets probation for hate crime",
      "link": "https://chicago.suntimes.com/chicago-suburbs/2026/02/19/lombard-man-gets-probation-for-hate-crime",
      "published": "2026-02-19T19:22:16.944-06:00",
      "published_parsed": "2026-02-20T01:22:16",
      "summary": "<img alt=\"A Lombard man was sentenced this week to probation in a hate crime. \" src=\"https://cst.brightspotcdn.com/dims4/default/999ef71/2147483647/strip/true/crop/6631x4423+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F1c%2Fbf%2Fcfb66e4141edb5238d4c5369c279%2Fcpd-03.JPG\" />\n        \n        \n            &lt;p&gt;A Lombard man has been sentenced to probation for committing an anti-Muslim hate crime.&lt;/p&gt;&lt;p&gt;Larry York was sentenced Tuesday to 180 days in jail, 30 months of probation and 200 hours of community service, according to DuPage County court records.&lt;/p&gt;&lt;p&gt;He pleaded guilty Nov. 20 to one count of felony hate crime.&lt;/p&gt;&lt;p&gt;York was accused of threatening two people on Oct. 17, 2023. He approached a man who was waiting for a friend in a car in front of York’s apartment building, a prosecutor said at a pretrial detention hearing when York was arrested.&lt;/p&gt;&lt;p&gt;The Chicago office of the Council on American-Islamic Relations praised prosecutors and Lombard police.&lt;/p&gt;&lt;p&gt;For more on this story, please visit &lt;a class=\"Link\"  href=\"https://www.dailyherald.com/20260219/crime/lombard-man-gets-probation-for-hate-crime/\"  target=\"_blank\"   &gt;DailyHerald.com&lt;/a&gt;. &lt;/p&gt;",
      "author": "Susan Sarkauskas | Daily Herald",
      "id": "https://chicago.suntimes.com/chicago-suburbs/2026/02/19/lombard-man-gets-probation-for-hate-crime",
      "tags": []
    },
    {
      "title": "Gregg Berhalter, Fire looking to take next step in 2026",
      "link": "https://chicago.suntimes.com/fire/2026/02/19/gregg-berhalter-fire-looking-to-take-next-step-in-2026",
      "published": "2026-02-19T18:52:52.327-06:00",
      "published_parsed": "2026-02-20T00:52:52",
      "summary": "<img alt=\"Philip Zinckernagel and the Fire open the season Saturday in Houston, looking to take the next step after reaching the 2025 MLS playoffs.\" src=\"https://cst.brightspotcdn.com/dims4/default/d905aee/2147483647/strip/true/crop/4709x3139+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff7%2Fb1%2Fbc7b605d402cb112c87812bf1e79%2F20250503-chivorl-philip-zinckernagel-db3-6082e.jpg\" />\n        \n        \n            &lt;p&gt;Last year under new coach and director of football Gregg Berhalter, the &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/fire\"   &gt;Fire&lt;/a&gt; became a competent team. They ended a playoff drought that dated back to 2017 and won a postseason game for the first time since 2009.&lt;/p&gt;&lt;p&gt;The challenge this season for Berhalter and the Fire is to reach another level and grow into a true Eastern Conference contender &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/fire/2025/10/21/after-eight-years-away-fire-finally-set-for-playoff-return\"   &gt;after finishing eighth in 2025,&lt;/a&gt; 13 points behind the first-place Philadelphia Union.&lt;/p&gt;&lt;p&gt;Whether it’s turning into a good team like the Fire did last year or maturing into a really good one like they hope to in 2026, they know both steps are difficult.&lt;/p&gt;&lt;p&gt;“They might be equally hard,” said Fire attacker Philip Zinckernagel, a 2025 MLS All-Star.&lt;/p&gt;&lt;p&gt;Berhalter, Zinckernagel and the Fire open the season Saturday night in Houston against the Dynamo. Despite selling midfielder Brian Gutierrez in December to Mexican club Chivas de Guadalajara, the Fire arguably have a stronger roster than 2025. Through free agency, they added experienced midfielder Robin Lod while signing promising South African defender Mbekezeli Mbokazi and acquiring Swedish midfielder Anton Salétros from Stockholm-based AIK.&lt;/p&gt;&lt;p&gt;They’re also in their second year under Berhalter, who understands the grind of an MLS schedule. He said the Fire’s focus is having a strong season to position themselves to win a championship, and not trying to win a trophy in February.&lt;/p&gt;&lt;p&gt;“We want to be well-positioned as we go into the playoffs, to be able to win playoff series and keep moving,” Berhalter said. “It’s easier said than done, but what I’d say is the group understands the expectations. We’ve added quality to this group, we’ve added experience to this group, so we’re hoping to be better.”&lt;/p&gt;&lt;p&gt;Being better than the 2025 Fire would mean shoring up the team defense. They gave up 60 goals last year, fourth-worst in the East. Because of those issues, the Fire only finished with a plus-8 goal differential despite scoring the second-most goals in the conference.&lt;/p&gt;&lt;p&gt;More important than goal difference, the Fire could only clinch a playoff berth with two games to spare and were thrown into the Eastern Conference wild-card game. They beat Orlando City 3-1 in that home match but earned the right to face the Union and were dispatched in two games that highlighted the gulf between the Fire and an MLS power.&lt;/p&gt;&lt;p&gt;Zinckernagel wants to do better in 2026. He said the Fire have the high-quality players, potential and hunger to make that happen.&lt;/p&gt;&lt;p&gt;“Ideally, we want to be qualifying for the playoffs much earlier, maybe competing for [the Supporters’] Shield, or be at the top of our conference,” Zinckernagel said. “It’s still a project that’s only been a year since Gregg came in and we’re building on our playing style and trying to get better every day.”&lt;/p&gt;&lt;p&gt;At least for the Fire, the questions around the 2026 team are different from most of the last 15 years. Instead of wondering about the future of the coach or whether the team is making progress, the subject is if they can build on legitimate success and rise to the level of a true MLS contender.&lt;/p&gt;&lt;p&gt;Zinckernagel said that isn’t adding any pressure to him and his teammates.&lt;/p&gt;&lt;p&gt;“The team is very motivated and hungry to get better and take [the] next steps. We made it to the playoffs last year, we won at home but we want to make it further,” Zinckernagel said. “We want to set the tone for this club to be up there as a team that can compete and be in the playoffs every season – not only being in the playoffs but also achieving something.”&lt;/p&gt;",
      "author": "Brian Sandalow",
      "id": "https://chicago.suntimes.com/fire/2026/02/19/gregg-berhalter-fire-looking-to-take-next-step-in-2026",
      "tags": []
    },
    {
      "title": "Cook County Jail safety concerns raised after inmate's death ruled a homicide",
      "link": "https://chicago.suntimes.com/public-safety/2026/02/19/advocates-raise-safety-concerns-after-death-of-man-in-cook-county-jail-ruled-a-homicide",
      "published": "2026-02-19T18:33:31.73-06:00",
      "published_parsed": "2026-02-20T00:33:31",
      "summary": "<img alt=\"A man died in Cook County Jail last November after his cellmate started a fire in their cell, according to the Cook County sheriff's office.\" src=\"https://cst.brightspotcdn.com/dims4/default/e76c3e2/2147483647/strip/true/crop/5760x3840+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fb2%2F38%2Fbc08ae035a61fa6748cc5b2d61fc%2Fcookcountyjail-111116-002-65268457.jpg\" />\n        \n        \n            &lt;p&gt;The death of a Cook County Jail inmate last fall is raising questions about whether staff could have done more to save him after the medical examiner’s office ruled his death a homicide.&lt;/p&gt;&lt;p&gt;Martinez Duncan, 24, died on the evening of Nov. 20 after his cellmate started a fire inside their locked cell according to a Cook County sheriff’s office spokesperson.&lt;/p&gt;&lt;p&gt;A preliminary review found the fire was caused by a lit wick, or “a smoldering portion of tightly wound toilet paper commonly used to smoke illegal drugs,” the sheriff’s office said.&lt;/p&gt;&lt;p&gt;Duncan and his cellmate were removed from their cell as jail staff attempted to put out the fire, the spokesperson said in a statement. They were then cuffed and taken to a holding area to receive medical care. After that, the staff left the holding area to tend to the fire.&lt;/p&gt;&lt;p&gt;In the meantime, “Duncan’s body slumped forward in the holding area and remained in that position until correctional staff and medical staff returned,” the spokesperson said.&lt;/p&gt;&lt;p&gt;Duncan was transported to Mount Sinai Hospital, where he was later pronounced dead.&lt;/p&gt;&lt;p&gt;In recently released findings, the medical examiner’s office listed the cause of Duncan’s death as cardiac arrest “during physical struggle with restraint.” Smoke inhalation, atherosclerosis and obesity were listed as secondary contributing factors.&lt;/p&gt;&lt;p&gt;It’s unclear how long the fire was burning in the cell before Duncan and his cellmate were removed.&lt;/p&gt;&lt;p&gt;Duncan’s death was one of nine recorded at the jail last year, according to the sheriff’s office. Of the remaining eight, two deaths were ruled suicides, and two were determined to be from natural causes. The cause and manner of death of the other four are pending the completion of autopsies.&lt;/p&gt;&lt;p&gt;Matthew McLoughlin of the Illinois Network for Pretrial Justice said he wasn’t surprised to hear about the details of Duncan’s case.&lt;/p&gt;&lt;p&gt;“Deaths in Cook County Jail have been all too common over the last decade,” he said. &lt;/p&gt;&lt;p&gt;He added that many of them are a result of &lt;a class=\"Link\"  href=\"https://www.injusticewatch.org/project/jail-deaths/2024/cook-county-jail-deaths-2023/\"  target=\"_blank\"   &gt;&lt;u&gt;inadequate supervision and medical care&lt;/u&gt;&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;“We are incredibly concerned that the Cook County sheriff's office has made clear that they are unable to keep people that are in their custody safe,” McLoughlin said.&lt;/p&gt;&lt;p&gt;A homicide ruling by the medical examiner indicates that another person caused Duncan’s death, but it does not imply that a criminal act took place.&lt;/p&gt;&lt;p&gt;The Illinois State Police Public Integrity Task Force is investigating Duncan’s death for any potential criminal behavior by staff, according to the sheriff’s office. The sheriff’s office custodial investigations unit and the sheriff’s office of professional review are also conducting their own investigations.&lt;/p&gt;&lt;p&gt;But McLoughlin said he’s not confident that the investigations will deliver justice.&lt;/p&gt;&lt;p&gt;“Speaking to the volume of instances where these deaths have happened, people have not been brought to justice, and there haven't been fundamental changes made over at the jail to prevent deaths like these,” McLoughlin said.&lt;/p&gt;&lt;p&gt;The sheriff’s office plans to pursue criminal charges against Duncan’s cellmate, who the spokesperson said has admitted to starting the fire.&lt;/p&gt;",
      "author": "Anna Savchenko | WBEZ",
      "id": "https://chicago.suntimes.com/public-safety/2026/02/19/advocates-raise-safety-concerns-after-death-of-man-in-cook-county-jail-ruled-a-homicide",
      "tags": []
    }
  ],
  "last_updated": "2026-02-20T03:47:40.890796"
}