{
  "date": "2026-03-01",
  "entry_count": 1,
  "entries": [
    {
      "title": "Encouraging signs for Justin Steele as he continues rehab",
      "link": "https://chicago.suntimes.com/cubs/2026/02/28/encouraging-signs-for-justin-steele-as-he-continues-rehab-rea",
      "published": "2026-02-28T18:03:42.544-06:00",
      "published_parsed": "2026-03-01T00:03:42",
      "summary": "<img alt=\"Cubs starting pitcher Justin Steele throws against the Rangers during the first inning of a baseball game in Chicago, Monday, April 7, 2025. \" src=\"https://cst.brightspotcdn.com/dims4/default/c6469b7/2147483647/strip/true/crop/902x602+0+0/resize/840x561!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F45%2F9c%2F9f0cc60c49a18fd190109e6516c2%2Fscreenshot-2026-02-28-at-5-55-29-pm.png\" />\n        \n        \n            &lt;p&gt;GLENDALE, Arizona — Justin Steele’s declaration post that he was “cleared” by Dr. Keith Meister sent good vibes through thousands of his social media followers and Colin Rea.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;But Steele, who underwent surgery last April to repair a torn ulnar collateral ligament and flexor tendon in his left arm, still faces at least a few months in his rehabilitation.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;And Rea, who served as a valuable swingman for the Cubs last year, isn’t making any assumptions as he prepares for the same role in 2026.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;“I'm pumped for Steele,” Rea said after throwing three scoreless innings against the Dodgers. “I heard him say that, too. It's good to see that he's ready to go, and he's feeling good.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;“But as far as for me, I don't think anything changes. That stuff's out of my control. We have such a deep staff that we got plenty of guys that can fill those roles. And like we're saying earlier, whatever Counce for us, we'll be ready.”&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;Steele wrote on his post that Meister had told him to “start building up and get ready for games” after posting a video of his bullpen session Friday.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;The Cubs have yet to put Steele on the 60-day injured list, but that could be a formality if they need to clear space on the 40-man roster.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;And as for Rea, who made 27 starts for the Cubs in 2025, there’s plenty of work ahead - especially with his changeup - as he threw only 29 of 51 pitches for strikes and fell behind in counts often.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;“I think (the changeup) needs to get better (to left-handed batters),” Rea said. “I think my games last year, where I did well, and my changeup was a big part of those. Early in spring, it hasn't been good.”&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;b&gt;Pete Speak&lt;/b&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;Pete Crow-Armstrong possesses a colorful language, that sometimes needs an explanation or even a translation.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;Manager Craig Counsell said he sought answers after failing to understand his prized center fielder’s self-examination.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;“Sometimes, Pete says things that I have no idea what they mean, no idea what they mean,” Counsell said. “And even when he explains them, they have no idea what he means.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;“But that's OK. I like that. I enjoy that. It actually makes me think a little bit, and a lot of players do that, so it's fun. I just think that's a very personal thing that I think we all hope that we get better at that as we just get older, no matter what you're doing.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;“He said something yesterday. ‘I (said), Pete can you explain because I don't know what it means.”&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;b&gt;Hodge podge&lt;/b&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;Porter Hodge continues to struggle with finding his control that helped him emerge as a standout reliever in 2024 when he posted an 0.884 WHIP to go with a 1.88 ERA in 39 appearances.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;“We need to be in the strike zone more, flat out,” Counsell said of Hodge, who has walked seven in two innings covering three spring games. “I think we got walks in every outing, multiple walks in two of three.”&lt;/p&gt;&lt;p&gt;&lt;b&gt;Cubs 6, Dodgers 2&lt;/b&gt;&lt;/p&gt;&lt;p&gt;Ben Brown pitched with plenty of conviction during two scoreless innings. The most encouraging aspect of Brown’s performance was that he didn’t walk a batter while using his knuckle curve effectively to complement his 97 mph fastball and struck out three.&lt;/p&gt;&lt;p&gt;• Christian Bethancourt, vying for a backup catching job, made his spring debut and made a favorable impression on starter Colin Rea. This marked the first time they worked together since their days with the Padres 10 years ago, and Rea appreciated that Bethancourt challenged him by mixing speeds early in counts and not allowing him to get into a pattern. Bethancourt will depart soon to play for Team Panama in the WBC.&lt;/p&gt;&lt;p&gt;• Keep an eye on Kevin Alcantara. The Cubs’ top outfield prospect, also making his spring debut after undergoing hernia surgery, employed a new wider batting stance. Alcantara went 0-for-4 with two strikeouts but fouled off five pitches during a nine-pitch sequence in his first at-bat before flying to center. Alcantara, who has one minor league option left, said he will make a start in the outfield on Monday.&lt;/p&gt;&lt;p&gt;• &lt;b&gt;ON DECK:&lt;/b&gt; Cubs vs. White Sox, Sunday, 1:05 p.m., Mesa, Ariz. LHP Shota Imanaga vs. LHP Anthony Kay&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;table class=\"cf wS\" role=\"presentation\" style=\"border-collapse: collapse;\" id=\"rte-d2307390-1500-11f1-b5fd-3b28f5d41604\"&gt;&lt;tbody&gt;&lt;tr&gt;&lt;td colspan=\"1\" rowspan=\"1\" class=\"amq\" style=\"margin: 0px; padding: 0px 16px; vertical-align: top; width: 44px; visibility: hidden;\"&gt;&lt;/td&gt;&lt;td colspan=\"1\" rowspan=\"1\" class=\"amr\" style=\"margin: 0px; padding: 0px; width: 728.667px;\"&gt;&lt;br&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;table class=\"cf wS\" role=\"presentation\" style=\"border-collapse: collapse;\" id=\"rte-b9e03d20-1500-11f1-b5fd-3b28f5d41604\"&gt;&lt;tbody&gt;&lt;tr&gt;&lt;td colspan=\"1\" rowspan=\"1\" class=\"amq\" style=\"margin: 0px; padding: 0px 16px; vertical-align: top; width: 44px; visibility: hidden;\"&gt;&lt;/td&gt;&lt;td colspan=\"1\" rowspan=\"1\" class=\"amr\" style=\"margin: 0px; padding: 0px; width: 728.667px;\"&gt;&lt;br&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/tbody&gt;&lt;/table&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;",
      "author": "Mark Gonzales",
      "id": "https://chicago.suntimes.com/cubs/2026/02/28/encouraging-signs-for-justin-steele-as-he-continues-rehab-rea",
      "tags": []
    }
  ],
  "last_updated": "2026-03-01T00:18:35.518955"
}