{
  "date": "2026-02-13",
  "entry_count": 1,
  "entries": [
    {
      "title": "Cubs' Shota Imanaga seeking 'better version of what I am now' after rocky postseason showing",
      "link": "https://chicago.suntimes.com/cubs/2026/02/12/cubs-shota-imanaga-seeking-better-version-of-what-i-am-now-after-rocky-postseason-showing",
      "published": "2026-02-12T18:10:24.411-06:00",
      "published_parsed": "2026-02-13T00:10:24",
      "summary": "<img alt=\"Shota Imanaga addresses the media at Cubs spring training in Mesa, AZ on February 12, 2026.\" src=\"https://cst.brightspotcdn.com/dims4/default/9b866ef/2147483647/strip/true/crop/4200x2800+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F87%2Ff1%2F3ac3f5f242a0966dc508ee4e512f%2Fst26-imanaga-02-f12.jpg\" />\n        \n        \n            &lt;p&gt;MESA, Ariz. – If &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs\"   &gt;Cubs&lt;/a&gt; left-hander Shota Imanaga had looked like his usual self on the mound in the postseason, he would have taken the ball in Game 5 of the National League Division Series, pitching coach Tommy Hottovy reflected Thursday.&lt;/p&gt;&lt;p&gt;Instead, the Cubs went with a bullpen game in the loss to the Brewers that wrapped up their postseason run. After the game, a solemn Imanaga took on his share of the blame, and much more.&lt;/p&gt;&lt;p&gt;“We have so many really good players that can perform,” Imanaga said then, through Japanese interpreter Edwin Stanberry. “And just watching that, it was amazing. And for me personally, I need to get to that level.”&lt;/p&gt;&lt;p&gt;The offseason brought a series of contract option decisions, for both him and the Cubs, that briefly &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs/2025/11/04/cubs-left-hander-shota-imanaga-becomes-free-agent-after-club-and-player-options-declined\"   &gt;sent Imanaga into free agency.&lt;/a&gt; The saga ended when Imanaga &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs/2025/11/06/cubs-extend-qualifying-offers-to-shota-imanaga-and-kyle-tucker\"   &gt;agreed to the qualifying offer to return for 2026.&lt;/a&gt;&lt;/p&gt;&lt;p&gt;“He'd shown what he can do at such a high level, and then just to not quite have that when we needed it the most down the stretch – he wanted more,” Hottovy said. “He thinks there’s more in there, there's more to prove. And you can tell by the way he's come into spring training that he feels that way because he's in such a great place from where he was at the &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs/2025/10/06/how-shota-imanagas-throwing-philosopher-side-came-out-post-injury-nlds-brewers-game-2\"   &gt;end of the year last year&lt;/a&gt;.”&lt;/p&gt;&lt;p&gt;Imanaga also had to decide whether to participate in the World Baseball Classic this spring, after winning the championship with Team Japan in 2023. At winter meetings in December, national team manager Hirokazu Ibata said through an interpreter that he would be disappointed if Imanaga opted out of the tournament because of the caliber of player he is.&lt;/p&gt;&lt;p&gt;Imanaga’s circumstances, however, had changed since last WBC. He was now playing for an MLB team, which was involved in the decision-making process, and knew he needed a bounce-back.&lt;/p&gt;&lt;p&gt;“I'm talking to everybody around me, getting everybody's opinion,” Imanaga said Thursday. “We thought that making your own adjustments, practicing here in Arizona is probably for the best.”&lt;/p&gt;&lt;p&gt;Imanaga has been one of the Cubs’ top starters for much of his time in MLB, finishing fifth in NL Cy Young voting his rookie season and starting last season with an Opening Day nod and strong first half.&lt;/p&gt;&lt;p&gt;The Cubs believe the hamstring strain Imanaga sustained in May impacted his execution down the stretch, through some combination of a loss of strength and/or trust in his left leg.&lt;/p&gt;&lt;p&gt;“His delivery does have a lot of like depth in terms of how he gets in his back leg,” Hottovy said. “But his strength comes from holding that position and then rotating hard late. And I think he was having to [adjust] how he was rotating, which was then affecting how his arm path was. And he knew he was trying to get his arm path up a little bit and slightly higher arm release point, but he just couldn't do it.”&lt;/p&gt;&lt;p&gt;Coming into spring, the force Imanaga is generating from that drive leg, measured by force plate technology in the Cubs’ spring training facilities, is comparable to in-game measurements before the injury, Hottovy said. That’s an improvement on his bullpens this time last year.&lt;/p&gt;&lt;p&gt;“More importantly, we're just seeing very consistent mechanics right now, too,” Hottovy said, “and him not trying to search for anything.”&lt;/p&gt;&lt;p&gt;Imanga said he focused on his overall strength this offseason, but also \"leveling up” every other aspect of his game.&lt;/p&gt;&lt;p&gt;When Imanaga’s fastball was getting hit for home runs at a higher clip, it was often because he wasn’t getting the pitch to the top rail or the bottom of the zone. So, that will be a focal point this spring. But Hottovy also highlighted several ways Imanaga could hone and expand his arsenal, from taking another step forward with his sweeper, to reintroducing his cutter.&lt;/p&gt;&lt;p&gt;“If you're chasing a specific version of you from a different year, you can go into a downward spiral,” Imanaga said, pushing back on the notion that he was trying to recapture an earlier version of himself. “So instead of focusing on what I had in the past, just try to be a better version of what I am right now.”&lt;br&gt;&lt;/p&gt;",
      "author": "Maddie Lee",
      "id": "https://chicago.suntimes.com/cubs/2026/02/12/cubs-shota-imanaga-seeking-better-version-of-what-i-am-now-after-rocky-postseason-showing",
      "tags": []
    }
  ],
  "last_updated": "2026-02-13T00:19:28.670898"
}