{
  "date": "2026-02-07",
  "entry_count": 1,
  "entries": [
    {
      "title": "Pritzker's pension plan could crash into fiscal pain inflicted by Trump",
      "link": "https://chicago.suntimes.com/columnists/2026/02/06/pritzker-pension-proposal-debt-federal-tax-snap-medicaid-rich-miller",
      "published": "2026-02-06T18:00:00-06:00",
      "published_parsed": "2026-02-07T00:00:00",
      "summary": "<img alt=\"Gov. JB Pritzker last month at the Chicago Cultural Center.\" src=\"https://cst.brightspotcdn.com/dims4/default/91d1c3e/2147483647/strip/true/crop/4486x2992+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fa9%2F61%2F9720920a49a48af3d7e3c11ff260%2Fjazzday-260121-004.jpg\" />\n        \n        \n            &lt;p&gt;Gov. JB Pritzker announced a plan last week to “manage Illinois pension commitments through a set of proposals designed to build on the state’s recent fiscal progress and further reduce long-term risk for taxpayers and retirees.”&lt;/p&gt;&lt;p&gt;The price tag, however, is already giving one legislative leader pause. And “fiscal progress” is not the reality when factoring in federal funds.&lt;/p&gt;&lt;p&gt;The governor wants to use “unexpected surplus revenues” to pay down pension debt. That, in turn, will help the state reach 100% pension funding by 2048 (instead of the current goal of 90% by 2045) and make sure that some pension benefits meet the Social Security law’s minimum benefit standards.&lt;/p&gt;&lt;p&gt;“The Governor is proposing to redirect excess amounts not needed for state income tax refunds to pay down Illinois’ pension commitments by transferring surplus funds above a $150 million balance to the state’s retirement systems at the end of the year,” his press release claimed.&lt;/p&gt;&lt;div class=\"RichTextSidebarModule Enhancement\" data-module data-align-center&gt;&lt;a class=\"AnchorLink\" id=\"module-b30000\" name=\"module-b30000\"&gt;&lt;/a&gt;\n        &lt;div class=\"RichTextSidebarModule-title\"&gt;Columnist &lt;/div&gt;\n    \n\n    \n\n    \n    &lt;div class=\"RichTextModule-items RichTextBody\"&gt;Columnist&lt;/div&gt;\n\n\n&lt;/div&gt;&lt;p&gt;So, I asked how much the governor’s plan would cost. The price tag would vary from year to year, I was told.&lt;/p&gt;&lt;p&gt;In fiscal year 2024, the new pension idea would’ve cost a whopping $405 million, a governor’s office spokesperson said. In fiscal year 2025, the amount would’ve been $103 million. And this fiscal year, when the state budget is under siege by federal government budget cuts, the amount would’ve been $550 million.&lt;/p&gt;&lt;p&gt;“I don’t know if this is the year to do it, because I don’t think we do that in isolation,” Senate President Don Harmon said of the governor’s idea during an event sponsored by Politico. “I think the price tag right now may be too much to pay, when tomorrow morning, we could be another billion dollars in the hole because of a tweet,” Harmon said of President Donald Trump, according to the publication.&lt;/p&gt;&lt;p&gt;The next morning, the Pritzker administration released a report about the impact of other federal actions on the state’s budget.&lt;/p&gt;&lt;p&gt;According to the Governor’s Office of Management and Budget report, the hit to the state budget from congressional tax changes alone will be “$587 million for the current fiscal year.” Legislation was passed during the veto session to reduce the original $830 million hit. And more legislative actions are expected later this spring to address some of the rest. Plus, this year’s amount will decrease over the coming years.&lt;/p&gt;&lt;p&gt;But you can clearly see the point I’m trying to make here. An additional $550 million pension payment this fiscal year to help the state pay off the pension debt earlier would’ve greatly harmed the state’s ability to deal with the federal tax changes.&lt;/p&gt;&lt;p&gt;To be clear, there are definite advantages to the governor’s pension proposal, including long-term savings. Illinois has too often focused on the short term instead of thinking about long-term policy.&lt;/p&gt;&lt;p&gt;But, man, I just do not see how Democratic legislators are gonna agree to take away any cash buffers while the state budget is under constant federal siege, with more likely on the way.&lt;/p&gt;&lt;h3&gt;Declining federal revenues&lt;/h3&gt;&lt;p&gt;The Legislature’s Commission on Government Forecasting and Accountability reported last week that January’s federal revenue sources plummeted 36% compared to the previous January. The fiscal year-to-date numbers had dropped 8% by the end of January, but last month was the third consecutive month of declining federal revenues.&lt;/p&gt;&lt;p&gt;The federal tax changes and revenue hits are, of course, just the tip of the spear.&lt;/p&gt;&lt;p&gt;The Governor’s Office of Management and Budget report noted that preparing for new eligibility rules for the Supplemental Nutrition Assistance Program, or SNAP, and Medicaid will cost the state $100 million during the next two fiscal years. Increases to state SNAP administrative costs will increase by $80 million a year beginning next fiscal year. If the state’s SNAP “error rate” isn’t reduced, the state’s taxpayers will have to pony up $705 million a year. Federal Medicaid payments are scheduled to be reduced by $4.5 billion over the next five years, and $3.8 billion a year beginning in seven years.&lt;/p&gt;&lt;p&gt;At least for the time being, the state really needs to move to a fiscal “war footing” — for lack of a better term. Illinois has to make sure it can provide an adequate social safety net and provide basic services. All new spending ideas really should be put on hold.&lt;/p&gt;&lt;p&gt;In other words, please save your press release bills until after this immediate crisis passes.&lt;/p&gt;&lt;p&gt;There’s plenty of talk about new “progressive” revenues. But even if the state goes that route, it still has to stop with the new spending ideas and focus on protecting and building on what exists now, at least for the foreseeable future.&lt;/p&gt;&lt;p&gt;&lt;i&gt;Rich Miller also publishes Capitol Fax, a daily political newsletter, and CapitolFax.com.&lt;/i&gt;&lt;/p&gt;&lt;div class=\"RichTextSidebarModule Enhancement\" data-module data-align-center&gt;&lt;a class=\"AnchorLink\" id=\"module-d30000\" name=\"module-d30000\"&gt;&lt;/a&gt;\n\n    \n\n    \n    &lt;div class=\"RichTextModule-items RichTextBody\"&gt;Send letters to &lt;a class=\"Link\"  href=\"mailto:letters@suntimes.com\"  target=\"_blank\"   &gt;letters@suntimes.com&lt;/a&gt;. More about &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/submitting-opinion-and-letters\"   &gt;how to submit here&lt;/a&gt;.&lt;/div&gt;\n\n\n&lt;/div&gt;&lt;p&gt;&lt;/p&gt;",
      "author": "Rich Miller",
      "id": "https://chicago.suntimes.com/columnists/2026/02/06/pritzker-pension-proposal-debt-federal-tax-snap-medicaid-rich-miller",
      "tags": []
    }
  ],
  "last_updated": "2026-02-07T00:17:04.737766"
}