{
  "date": "2026-02-25",
  "entry_count": 1,
  "entries": [
    {
      "title": "Reaction to Pete Crow-Armstrong's Dodgers fan comments says everything about his celebrity status",
      "link": "https://chicago.suntimes.com/cubs/2026/02/24/reaction-to-pete-crow-armstrongs-dodgers-fan-comments-says-everything-about-his-celebrity-status",
      "published": "2026-02-24T18:16:28.041-06:00",
      "published_parsed": "2026-02-25T00:16:28",
      "summary": "<img alt=\"Pete Crow-Armstrong gives autographed bats and signed baseballs to children at Cubs spring training in Mesa, AZ on February 19, 2026.\" src=\"https://cst.brightspotcdn.com/dims4/default/e775fbf/2147483647/strip/true/crop/4200x2800+0+0/resize/840x560!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F7d%2Ff1%2F8f48509e4a97b6e693fb1f04a98d%2Fst26-pca-14-f19.jpg\" />\n        \n        \n            &lt;p&gt;MESA, Ariz. – The rollout of Chicago Magazine’s Pete Crow-Armstrong cover story started with a photo.&lt;/p&gt;&lt;p&gt;A bat slung over his shoulders, the &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs\"   &gt;Cubs&lt;/a&gt; young star turned to look straight into the camera. His tongue hung out of an easy grin, in an expression that captured his youthful confidence.&lt;/p&gt;&lt;p&gt;The story accompanying it was a glowing profile that contrasted Crow-Armstrong’s rising stardom with his harsh self-criticism.&lt;/p&gt;&lt;p&gt;When it dropped on Monday, however, one quote in particular ignited a fiery reaction on social media: “I love Chicago more and more. It’s just an incredible city. The people are great. They give a shit. They aren’t just baseball fans who go to the game like Dodgers fans to take pictures and whatever. They are paying attention. They care.”&lt;/p&gt;&lt;p&gt;Aggregators pulled Crow-Armstrong’s words out of the story and dropped them onto graphics devoid of context. Dodgers fans’ reactions added fuel to the blaze.&lt;/p&gt;&lt;p&gt;That’s what happens when a player reaches &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs/2025/05/03/cubs-pete-crow-armstrong-on-offensive-tear-with-permission-to-be-himself-be-a-star\"   &gt;celebrity status&lt;/a&gt;.&lt;/p&gt;&lt;p&gt;With a magnetic personality and emotion-forward playing style, Crow-Armstrong is caught in the awkward push and pull of a young career under intense magnification.&lt;/p&gt;&lt;p&gt;An MVP-level first half last year thrust Crow-Armstrong, a former first-round pick, into an even brighter spotlight. But while his gold glove defense held steady, he struggled at the plate down the stretch.&lt;/p&gt;&lt;p&gt;Crow-Armstrong – acquired as a prospect in the 2021 trade that sent Javy Báez to the Mets – has won Cubs fans’ affections. But for fans outside of Chicago, the player himself can be as polarizing as his 2025 offensive performance.&lt;/p&gt;&lt;p&gt;“Because of just who Pete is and because of his talents, I think there’s always going to be very high expectations,” manager Craig Counsell said Tuesday. “That’s the blessing and the curse of being very talented, right? And that’s OK. And I think Pete understands that better than we give him credit for. He understands that very, very well. And I think he handles it very, very well. That’s part of it. You’re going to talk about people like that a lot.”&lt;/p&gt;&lt;p&gt;The talk isn’t just about overall performance. It’s also the superhuman catch he pulled off in the outfield, or the helmet he cracked in a moment of frustration, or the blue stars he dyed into his hair.&lt;/p&gt;&lt;p&gt;Celebrity is rarer to achieve in baseball than other sports. The game doesn't lend itself to fame the same way. There’s no guarantee that the best player on their field will end up with the ball or a bat in his hand in the biggest moment.&lt;/p&gt;&lt;p&gt;Exceptions include the Dodgers’ Shohei Ohtani, one of the biggest sports stars in the world. But most baseball players can maneuver about their lives in relative anonymity.&lt;/p&gt;&lt;p&gt;Crow-Armstrong is no Ohtani, but he's definitely not anonymous.&lt;/p&gt;&lt;p&gt;Naturally, a fragment of a quote critical of his hometown fanbase would cause a stir.&lt;/p&gt;&lt;p&gt;Crow-Armstrong declined to comment on the Chicago Magazine piece Tuesday. But he’s leaned into banter with Dodgers fans in recent years, trading harmless jabs during trips to Los Angeles. &lt;/p&gt;&lt;p&gt;“I love playing here,” &lt;a class=\"Link\"  href=\"https://chicago.suntimes.com/cubs/2025/04/14/cubs-pete-crow-armstrong-breaks-out-of-slow-start-in-big-way\"   &gt;Crow-Armstrong said at Dodger Stadium last April&lt;/a&gt;, after hitting two home runs in a game that clinched a series win. “It’s a fun crowd, and I like the noise. I think the Cubbies like playing here, too.”&lt;/p&gt;&lt;p&gt;He paused for effect, a half smile tugging at the corner of his mouth.&lt;/p&gt;&lt;p&gt;Crow-Armstrong has an eye-popping 1.028 OPS at Dodger Stadium.&lt;/p&gt;&lt;p&gt;He grew up in Los Angeles and attended Harvard-Westlake High School. When he was young, Crow-Armstrong tied his fandom to specific players rather than teams. But eventually his Naperville-native dad, Matthew John Armstrong, convinced Crow-Armstrong to join the Cubs faithful. He especially had an affinity for Báez.&lt;/p&gt;&lt;p&gt;What a twist of fate that Báez’ trade would put Crow-Armstrong on track to become a Cubs star.&lt;/p&gt;&lt;p&gt;Crow-Armstrong’s schedule Tuesday was packed with sponsorship and TV duties. But when he stepped off MLB Network’s temporary set at the Cubs’ spring training complex, he spotted a kid holding a sign that read, “PCA is my hero,” and beelined to him.&lt;/p&gt;&lt;p&gt;Chatting about the Javy Báez baseball card the young fan handed him – the boy explained, “You’re my favorite player, and I know your favorite player is Javy.” – Crow-Armstrong was in his element.&lt;/p&gt;&lt;p&gt;Celebrity brings wholesome moments, too.&lt;br&gt;&lt;/p&gt;",
      "author": "Maddie Lee",
      "id": "https://chicago.suntimes.com/cubs/2026/02/24/reaction-to-pete-crow-armstrongs-dodgers-fan-comments-says-everything-about-his-celebrity-status",
      "tags": []
    }
  ],
  "last_updated": "2026-02-25T00:19:07.936438"
}